Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам.
Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. 
При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

1.Ввести строки через запятую. 
2.Введенная строка разбивается на массив строк.
3.Создаю метод FilterStrings, который принимает на вход исходный массив строк и возвращает новый массив, содержащий только строки, удовлетворяющие условиям (длина меньше или равна 3 символам).
4.В методе FilterStrings подсчитывается количество подходящих строк, затем создается новый массив нужной длины. Затем строки из исходного массива, удовлетворяющие условиям, копируются в новый массив.
5.Новый массив строк выводится на экран с использованием Console.WriteLine.
